---
kind: other
id: Properties.T:Autodesk.Revit.DB.SATImportOptions
source: html/e4b67b41-da27-9ebf-bb0c-d584927fa847.htm
---
# SATImportOptions Properties

Correct almost-vertical lines and almost-horizontal lines for import model
 if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.